app/views/permissions/show.html.erb

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `workers`.* FROM `workers`  WHERE `workers`.`user_id` = 1 AND `workers`.`id` = 1 LIMIT 1
---
  <H4>User:
    <%= @workers.find(@permission.worker_id).username  %></h4>

SELECT  "readers".* FROM "readers"  WHERE "readers"."id" = ? LIMIT 1  [["id", 1]]
---
  <h4>Location:
    <%= @readers.find(@permission.reader_id).desc %></h4>