app/controllers/check_ins_controller.rb

SELECT  `permissions`.* FROM `permissions`  WHERE `permissions`.`worker_id` = 1 AND `permissions`.`reader_id` = 1  ORDER BY `permissions`.`id` ASC LIMIT 1
---
  def auth
    card_serial = params[:card]
    reader_serial = params[:reader]
    CheckIn.create(:card_user => card_serial, :readerSerial => reader_serial)
    render_text = ""
    worker = Worker.where(:card => card_serial).first
    reader = Reader.where(:serial => reader_serial).first
    unless worker.nil? or reader.nil?
      @perm = Permission.where(:worker_id => worker.id, :reader_id => reader.id).first