app/controllers/check_ins_controller.rb

SELECT `check_ins`.* FROM `check_ins`
SELECT  `workers`.* FROM `workers`  WHERE `workers`.`card` = 'admsmth'  ORDER BY `workers`.`id` ASC LIMIT 1
SELECT COUNT(*) FROM `workers`  WHERE `workers`.`card` = 'admsmth'
SELECT  `readers`.* FROM `readers`  WHERE `readers`.`serial` = 'abcd'  ORDER BY `readers`.`id` ASC LIMIT 1
SELECT COUNT(*) FROM `readers`  WHERE `readers`.`serial` = 'abcd'
SELECT  `permissions`.* FROM `permissions`  WHERE `permissions`.`reader_id` = 1 AND `permissions`.`worker_id` = 1  ORDER BY `permissions`.`id` ASC LIMIT 1
SELECT  `permissions`.* FROM `permissions`  WHERE `permissions`.`permission_id` = 1  ORDER BY `permissions`.`id` ASC LIMIT 1
SELECT COUNT(*) FROM `permissions`  WHERE `permissions`.`reader_id` = 1 AND `permissions`.`user_id` = 1
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
SELECT COUNT(*) FROM `permissions`  WHERE `permissions`.`reader` = 1 AND `permissions`.`worker` = 1
---
  def index
    check_ins = CheckIn.all
    @resp = Array.new

    check_ins.each { |checkin|
      ss = Hash.new
      username = checkin.card_user
      uname = Worker.where(card: username)
      if not uname.nil? || uname.empty?
        ss[:name] = uname.first.username
      else
        ss[:name] = 'Unknown'
      end

      ulocation =  Reader.where(serial: checkin.readerSerial)
      if not ulocation.empty? || ulocation.nil?
        ss[:location] = ulocation.first.desc
      else
        ss[:location] = 'Unregistered reader'
      end
      ss[:time] = checkin.created_at
      ss[:style] = 'danger'
      perm = nil
      unless ulocation.empty? || ulocation.nil?

        unless uname.empty? || uname.nil?
        perm = Permission.where(reader_id: ulocation.first.id, user_id: uname.first.id)
        unless perm.nil? || perm.empty?
          ss[:style] = 'success'
        else if not uname.empty?

INSERT INTO "check_ins" ("card_user", "created_at", "readerSerial", "updated_at") VALUES (?, ?, ?, ?)  [["card_user", "qqq"], ["created_at", "2014-11-08 06:32:18.346605"], ["readerSerial", "qwe"], ["updated_at", "2014-11-08 06:32:18.346605"]]
SELECT  `workers`.* FROM `workers`  WHERE `workers`.`card` = 'admsmth'  ORDER BY `workers`.`id` ASC LIMIT 1
SELECT  `readers`.* FROM `readers`  WHERE `readers`.`serial` = 'abcd'  ORDER BY `readers`.`id` ASC LIMIT 1
SELECT "permissions".* FROM "permissions"  WHERE "permissions"."user_id" IN (SELECT "workers"."id" FROM "workers"  WHERE "workers"."card" = 'aaaa') AND "permissions"."reader_id" IN (SELECT "readers"."id" FROM "readers"  WHERE "readers"."serial" = 'bbbb')
---
  def auth
    card_serial = params[:card]
    reader_serial = params[:reader];
    CheckIn.create(:card_user => card_serial, :readerSerial => reader_serial)

    user_id = Worker.where(:card => card_serial).first
    reader_id = Reader.where(:serial => reader_serial).first
    unless user_id.nil? or reader_id.nil?
      @perm = Permission.where(:user_id => user_id.id, :reader_id => reader_id.id).first

SELECT  "check_ins".* FROM "check_ins"  WHERE "check_ins"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_check_in
      @check_in = CheckIn.find(params[:id])