app/controllers/options_controller.rb

SELECT `options`.* FROM `options`
---
  def index
    @options = Option.all

SELECT  `options`.* FROM `options`  WHERE `options`.`id` = 1 LIMIT 1
---
    def set_option
      @option = Option.find(params[:id])