app/controllers/permissions_controller.rb

  def index
    @permissions = Array.new
    Permission.all.each { |perm|
      s = Hash.new
      uid = perm.worker_id
      rid = perm.reader_id
      s[:user] = Worker.find(uid)
      s[:location] = Reader.find(rid)
---
SELECT `permissions`.* FROM `permissions`
SELECT  "workers".* FROM "workers"  WHERE "workers"."id" = ? LIMIT 1  [["id", 1]]
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
SELECT  "readers".* FROM "readers"  WHERE "readers"."id" = ? LIMIT 1  [["id", 1]]

  def show
    @workers = Worker.all.where(:user => current_user)
    @readers = Reader.all.where(:user => current_user)
---
SELECT  `workers`.* FROM `workers`  WHERE `workers`.`user_id` = 1 AND `workers`.`id` = 1 LIMIT 1
SELECT  `readers`.* FROM `readers`  WHERE `readers`.`user_id` = 1 AND `readers`.`id` = 1 LIMIT 1

  def new
    worker = Worker.all
    @workers = Array.new
    worker.each { |wrk|
      tmp = Array.new
      tmp.push(wrk.username)
      tmp.push(wrk.id)
      if wrk.user == current_user
        @workers.push(tmp)
      end
    }

    reader = Reader.all
---
SELECT  "workers".* FROM "workers"   ORDER BY "workers"."id" ASC LIMIT 1
SELECT `readers`.* FROM `readers`

  def edit
    worker = Worker.all
    @workers = Array.new
    worker.each { |wrk|
      tmp = Array.new
      tmp.push(wrk.username)
      tmp.push(wrk.id)
      if wrk.user == current_user
        @workers.push(tmp)
      end
    }

    reader = Reader.all
---
SELECT "workers".* FROM "workers"
SELECT "readers".* FROM "readers"

  def create
    @permission = Permission.new(permission_params)
    @permission.user = current_user
    @permission.save
---
INSERT INTO "permissions" ("created_at", "reader_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-09 15:53:35.916024"], ["reader_id", 1], ["updated_at", "2014-11-09 15:53:35.916024"], ["user_id", 2]]

  def update
    @permission.user = current_user
    @permission.update(permission_params)
---
UPDATE "permissions" SET "updated_at" = ?, "user_id" = ? WHERE "permissions"."id" = 1  [["updated_at", "2014-11-11 19:56:12.297486"], ["user_id", 2]]

  def destroy
    @permission.destroy
---
DELETE FROM `permissions` WHERE `permissions`.`id` = 2

    def set_permission
      @permission = Permission.find(params[:id])
---
SELECT  "permissions".* FROM "permissions"  WHERE "permissions"."id" = ? LIMIT 1  [["id", 1]]