app/controllers/permissions_controller.rb

SELECT  `workers`.* FROM `workers`  WHERE `workers`.`customer` = 1 AND `workers`.`id` = 2 LIMIT 1
SELECT  `readers`.* FROM `readers`  WHERE `readers`.`customer` = 1 AND `readers`.`id` = 1 LIMIT 1
---
  def show
    @workers = Worker.all.where(:customer => current_user.id)
    @readers = Reader.all.where(:customer => current_user.id)