app/controllers/readers_controller.rb

  def index
    @readers = Reader.all.where(:user => current_user)
---
SELECT `readers`.* FROM `readers`  WHERE `readers`.`user_id` = 1