app/controllers/readers_controller.rb

SELECT `readers`.* FROM `readers`  WHERE `readers`.`customer` = 1
---
  def index
    @readers = Reader.all.where(:customer => current_user.id)

INSERT INTO "readers" ("created_at", "customer", "desc", "serial", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-11-12 02:59:28.957039"], ["customer", 3], ["desc", "Location 2"], ["serial", "aaaa"], ["updated_at", "2014-11-12 02:59:28.957039"]]
---
  def create
    @reader = Reader.new(reader_params)
    @reader.customer = current_user.id
    @reader.save

SELECT  "readers".* FROM "readers"  WHERE "readers"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_reader
      @reader = Reader.find(params[:id])