app/controllers/workers_controller.rb

  def index
    @workers = Worker.all.where(:user => current_user)
---
SELECT `workers`.* FROM `workers`  WHERE `workers`.`user_id` = 1