app/controllers/workers_controller.rb

SELECT `workers`.* FROM `workers`  WHERE `workers`.`customer` = 1
---
  def index
    @workers = Worker.all.where(:customer => current_user.id)

INSERT INTO "workers" ("card", "created_at", "customer", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["card", "bbbb"], ["created_at", "2014-11-12 03:12:15.166382"], ["customer", 3], ["updated_at", "2014-11-12 03:12:15.166382"], ["username", "Employee 2"]]
---
  def create
    @worker = Worker.new(worker_params)
    @worker.customer = current_user.id
    flash[:notice] = 'Worker was successfully created.' if @worker.save

DELETE FROM "workers" WHERE "workers"."id" = ?  [["id", 3]]
---
  def destroy
    @worker.destroy

SELECT  "workers".* FROM "workers"  WHERE "workers"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_worker
      @worker = Worker.find(params[:id])